In [3]:
import pandas as pd

In [9]:

boats = pd.read_csv('data/05_shifts_to_boats_02.csv', encoding ='Windows 1252')
boats = boats.T

headers = ['boat1', 'time1', 'boat2', 'time2', 'boat3', 'time3']
boats.columns = headers
boats.index.name = 'date'


boats.to_csv('data/05_shifts_to_boats_03.csv', encoding ='utf-8') # I am saving it and again opening because it cannot read the 1st header otherwise

                boat1        time1 boat2 time2 boat3 time3
date
5/8/2023     Fantasia    1700-0200   NaN   NaN   NaN   NaN
5/9/2023          NaN          NaN   NaN   NaN   NaN   NaN
5/10/2023         NaN          NaN   NaN   NaN   NaN   NaN
5/11/2023         NaN          NaN   NaN   NaN   NaN   NaN
5/12/2023         NaN          NaN   NaN   NaN   NaN   NaN
...               ...          ...   ...   ...   ...   ...
9/27/2023         NaN          NaN   NaN   NaN   NaN   NaN
9/28/2023         NaN          NaN   NaN   NaN   NaN   NaN
9/29/2023         NaN          NaN   NaN   NaN   NaN   NaN
9/30/2023         NaN          NaN   NaN   NaN   NaN   NaN
10/1/2023  Trollfjord  0800 - 1800   NaN   NaN   NaN   NaN

[147 rows x 6 columns]

In [11]:
# serazeni vsech zmen za sebe

boats = pd.read_csv('data/05_shifts_to_boats_03.csv', encoding ='utf-8')

boats1 = boats[['date', 'boat1', 'time1']]
boats1 = boats1.rename(columns={'boat1' : 'boat', 'time1': 'time'})

boats2 = boats[['date', 'boat2', 'time2']]
boats2 = boats2.rename(columns={'boat2' : 'boat', 'time2': 'time'})

boats3 = boats[['date', 'boat3', 'time3']]
boats3 = boats3.rename(columns={'boat3' : 'boat', 'time3': 'time'})

new_times = pd.concat([boats1, boats2, boats3], ignore_index=True)
new_times

          date      boat       time
0     5/8/2023  Fantasia  1700-0200
1     5/9/2023       NaN        NaN
2    5/10/2023       NaN        NaN
3    5/11/2023       NaN        NaN
4    5/12/2023       NaN        NaN
..         ...       ...        ...
436  9/27/2023       NaN        NaN
437  9/28/2023       NaN        NaN
438  9/29/2023       NaN        NaN
439  9/30/2023       NaN        NaN
440  10/1/2023       NaN        NaN

[441 rows x 3 columns]

In [6]:
changes_only = new_times.dropna(subset=['boat'])
changes_only = changes_only.drop(17, axis='index')
changes_only

          date              boat         time
0     5/8/2023          Fantasia    1700-0200
11   5/19/2023   Otto Sverdrup ?  1400 - 2200
14   5/22/2023  Nieuw Statendam?    0800-1800
15   5/23/2023          Preziosa    1300-0100
18   5/26/2023          Aidaluna  2300 - 0500
..         ...               ...          ...
362  7/15/2023      Renaissance?  1400 – 2000
365  7/18/2023     Mein Schiff 1  1800 - 0400
366  7/19/2023            Amadea  1700 - 2300
381   8/3/2023    World Traveler  0800 - 1600
387   8/9/2023    World Traveler  0800 - 1600

[121 rows x 3 columns]

In [7]:
changes_only['boat'] = changes_only['boat'].replace('Aidabella', 'AIDAbella')
changes_only['boat'] = changes_only['boat'].replace('Aidaluna', 'AIDAluna')
changes_only['boat'] = changes_only['boat'].replace('AidaMar', 'AIDAmar')
changes_only['boat'] = changes_only['boat'].replace('Aidasol', 'AIDAsol')
changes_only['boat'] = changes_only['boat'].replace('Preziosa', 'MSC Preziosa')
changes_only['boat'] = changes_only['boat'].replace('Sverdrup', 'Otto Sverdrup')
changes_only['boat'] = changes_only['boat'].replace('Sverdrup ?', 'Otto Sverdrup')

In [8]:
changes_only.to_csv('data/05_shifts_to_boats_04.csv', encoding ='utf-8', index=False)